samples/uplane-vms/test-21-49-51-828301/stress.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: test_http.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 569 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m01.0s/1m0s

running (0m02.0s), 1/1 VUs, 1133 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m02.0s/1m0s

running (0m03.0s), 1/1 VUs, 1667 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m03.0s/1m0s

running (0m04.0s), 1/1 VUs, 2156 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m04.0s/1m0s

running (0m05.0s), 1/1 VUs, 2742 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m05.0s/1m0s

running (0m06.0s), 1/1 VUs, 3277 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m06.0s/1m0s

running (0m07.0s), 1/1 VUs, 3795 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m07.0s/1m0s

running (0m08.0s), 1/1 VUs, 4295 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m08.0s/1m0s

running (0m09.0s), 1/1 VUs, 4854 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m09.0s/1m0s

running (0m10.0s), 1/1 VUs, 5352 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m10.0s/1m0s

running (0m11.0s), 1/1 VUs, 5852 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m11.0s/1m0s

running (0m12.0s), 1/1 VUs, 6345 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  0m12.0s/1m0s

running (0m13.0s), 1/1 VUs, 6836 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  0m13.0s/1m0s

running (0m14.0s), 1/1 VUs, 7323 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  0m14.0s/1m0s

running (0m15.0s), 1/1 VUs, 7866 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  0m15.0s/1m0s

running (0m16.0s), 1/1 VUs, 8397 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  0m16.0s/1m0s

running (0m17.0s), 1/1 VUs, 8896 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  0m17.0s/1m0s

running (0m18.0s), 1/1 VUs, 9404 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  0m18.0s/1m0s

running (0m19.0s), 1/1 VUs, 9898 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  0m19.0s/1m0s

running (0m20.0s), 1/1 VUs, 10395 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  0m20.0s/1m0s

running (0m21.0s), 1/1 VUs, 10921 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  0m21.0s/1m0s

running (0m22.0s), 1/1 VUs, 11422 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  0m22.0s/1m0s

running (0m23.0s), 1/1 VUs, 11928 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  0m23.0s/1m0s

running (0m24.0s), 1/1 VUs, 12459 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  0m24.0s/1m0s

running (0m25.0s), 1/1 VUs, 13011 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  0m25.0s/1m0s

running (0m26.0s), 1/1 VUs, 13512 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  0m26.0s/1m0s

running (0m27.0s), 1/1 VUs, 14035 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  0m27.0s/1m0s

running (0m28.0s), 1/1 VUs, 14568 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  0m28.0s/1m0s

running (0m29.0s), 1/1 VUs, 15093 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  0m29.0s/1m0s

running (0m30.0s), 1/1 VUs, 15598 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  0m30.0s/1m0s

running (0m31.0s), 1/1 VUs, 16127 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  0m31.0s/1m0s

running (0m32.0s), 1/1 VUs, 16627 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  0m32.0s/1m0s

running (0m33.0s), 1/1 VUs, 17123 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  0m33.0s/1m0s

running (0m34.0s), 1/1 VUs, 17636 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  0m34.0s/1m0s

running (0m35.0s), 1/1 VUs, 18174 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  0m35.0s/1m0s

running (0m36.0s), 1/1 VUs, 18680 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  0m36.0s/1m0s

running (0m37.0s), 1/1 VUs, 19233 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  0m37.0s/1m0s

running (0m38.0s), 1/1 VUs, 19764 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  0m38.0s/1m0s

running (0m39.0s), 1/1 VUs, 20306 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  0m39.0s/1m0s

running (0m40.0s), 1/1 VUs, 20835 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  0m40.0s/1m0s

running (0m41.0s), 1/1 VUs, 21346 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  0m41.0s/1m0s

running (0m42.0s), 1/1 VUs, 21837 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  0m42.0s/1m0s

running (0m43.0s), 1/1 VUs, 22332 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  0m43.0s/1m0s

running (0m44.0s), 1/1 VUs, 22824 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  0m44.0s/1m0s

running (0m45.0s), 1/1 VUs, 23377 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  0m45.0s/1m0s

running (0m46.0s), 1/1 VUs, 23905 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  0m46.0s/1m0s

running (0m47.0s), 1/1 VUs, 24403 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  0m47.0s/1m0s

running (0m48.0s), 1/1 VUs, 24910 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  0m48.0s/1m0s

running (0m49.0s), 1/1 VUs, 25425 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  0m49.0s/1m0s

running (0m50.0s), 1/1 VUs, 25944 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  0m50.0s/1m0s

running (0m51.0s), 1/1 VUs, 26477 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  0m51.0s/1m0s

running (0m52.0s), 1/1 VUs, 26998 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  0m52.0s/1m0s

running (0m53.0s), 1/1 VUs, 27534 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  0m53.0s/1m0s

running (0m54.0s), 1/1 VUs, 28066 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  0m54.0s/1m0s

running (0m55.0s), 1/1 VUs, 28627 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  0m55.0s/1m0s

running (0m56.0s), 1/1 VUs, 29163 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  0m56.0s/1m0s

running (0m57.0s), 1/1 VUs, 29671 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  0m57.0s/1m0s

running (0m58.0s), 1/1 VUs, 30178 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  0m58.0s/1m0s

running (0m59.0s), 1/1 VUs, 30688 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  0m59.0s/1m0s

running (1m00.0s), 1/1 VUs, 31168 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  1m00.0s/1m0s

running (1m00.0s), 0/1 VUs, 31170 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  1m0s

     data_received..................: 55 MB  909 kB/s
     data_sent......................: 2.6 MB 43 kB/s
     http_req_blocked...............: avg=627.77µs min=268.56µs med=554.71µs max=13.37ms p(90)=790.98µs p(95)=981.1µs 
     http_req_connecting............: avg=583.62µs min=239.12µs med=512.07µs max=12.91ms p(90)=737.39µs p(95)=925.36µs
     http_req_duration..............: avg=1.23ms   min=592.03µs med=1.13ms   max=14.91ms p(90)=1.55ms   p(95)=1.84ms  
       { expected_response:true }...: avg=1.23ms   min=592.03µs med=1.13ms   max=14.91ms p(90)=1.55ms   p(95)=1.84ms  
     http_req_failed................: 0.00%  ✓ 0          ✗ 31170
     http_req_receiving.............: avg=77.51µs  min=18.43µs  med=67µs     max=13.21ms p(90)=121.41µs p(95)=145.24µs
     http_req_sending...............: avg=39.48µs  min=15.28µs  med=34.55µs  max=1.18ms  p(90)=61.29µs  p(95)=72.41µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=1.11ms   min=505.98µs med=1.02ms   max=14ms    p(90)=1.41ms   p(95)=1.67ms  
     http_reqs......................: 31170  519.483552/s
     iteration_duration.............: avg=1.91ms   min=969.25µs med=1.75ms   max=18.2ms  p(90)=2.43ms   p(95)=2.97ms  
     iterations.....................: 31170  519.483552/s
     vus............................: 1      min=1        max=1  
     vus_max........................: 1      min=1        max=1